app/views/concerts/search.html.erb

    <h1>
      Concert(s) à <%= @concerts.first.location %>
---
SELECT  "concerts".* FROM "concerts" WHERE "concerts"."location" = ? ORDER BY "concerts"."id" ASC LIMIT ?  [["location", "Salle Pleyel"], ["LIMIT", 1]]