app/controllers/concerts_controller.rb

  def index
    @concerts = Concert.all
---
SELECT "concerts".* FROM "concerts"

  def show
     @concerts = Concert.find(params[:id])
---
SELECT  "concerts".* FROM "concerts" WHERE "concerts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @concert = Concert.new(concert_params)

    respond_to do |format|
      if @concert.save
---
INSERT INTO "concerts" ("title", "location", "description", "capacity", "price", "image", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @concert.update(concert_params)
---
UPDATE "concerts" SET "date" = ?, "updated_at" = ? WHERE "concerts"."id" = ?  [["date", Tue, 20 Dec 2016], ["updated_at", 2016-11-10 13:07:44 UTC], ["id", 1]]

  def destroy
    @concert.destroy
---
DELETE FROM "concerts" WHERE "concerts"."id" = ?  [["id", 5]]

  def reservation
    # On crée un nouvel objet reservation à partir des paramètres reçus
    @reservation = Reservation.new(reservation_params)
    # On précise que cet object Reservation dépend du Concert concerné
    @reservation.concert = @concert

    respond_to do |format|
      if @reservation.save
---
INSERT INTO "reservations" ("user_id", "concert_id", "nb_people", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 2], ["concert_id", 1], ["nb_people", 3], ["created_at", 2016-10-15 14:19:14 UTC], ["updated_at", 2016-10-15 14:19:14 UTC]]

  def search
	if params[:location]
	then
		concerts=Concert.where("lower(location) = ?", params[:location].downcase)
	else concerts=Concert
	end

	if  params[:music_style]
	then
	music_styles=MusicStyle.where(name: params[:music_style])
	style_id=music_styles.first.id
	concert_preferences=ConcertPreference.where(style_id: style_id)
	concert_ids=[]
	concert_preferences.each do |concert_preference|
	concert_ids << concert_preference.concert_id
	end
	concerts = concerts.where(id: concert_ids)
	end

	if params[:date]
	then
		concerts=Concert.where(date: params[:date])
		else
		now = Time.now.to_datetime
	concerts=concerts.where("date > ?", now)
	end

	if params[:user_id]
	then
		concert_ids=[]
		reservations=Reservation.where(user_id: params[:user_id])
---
SELECT  "concerts".* FROM "concerts" WHERE "concerts"."location" = ? ORDER BY "concerts"."id" ASC LIMIT ?  [["location", "Paris"], ["LIMIT", 1]]
SELECT  "music_styles".* FROM "music_styles" WHERE "music_styles"."name" = ? ORDER BY "music_styles"."id" ASC LIMIT ?  [["name", "Jazz"], ["LIMIT", 1]]
SELECT  "music_styles".* FROM "music_styles" WHERE "music_styles"."music_style" = ? ORDER BY "music_styles"."id" ASC LIMIT ?  [["music_style", "Jazz"], ["LIMIT", 1]]
SELECT  "concert_preferences".* FROM "concert_preferences" WHERE "concert_preferences"."style_id" = ? ORDER BY "concert_preferences"."id" ASC LIMIT ?  [["style_id", 3], ["LIMIT", 1]]
SELECT "concerts".* FROM "concerts" WHERE (lower(location) = 'paris') AND "concerts"."id" IN (1, 3) AND (date >= '2016-11-12 16:52:31.929336') AND "concerts"."id" = 1
SELECT "concerts".* FROM "concerts" WHERE (lower(location) = 'paris') AND "concerts"."date" = ?  [["date", Thu, 10 Nov 2016 14:06:25 +0100]]
SELECT "reservations".* FROM "reservations" WHERE "reservations"."user_id" = ?  [["user_id", 1]]

    def set_concert
      @concert = Concert.find(params[:id])
---
SELECT  "concerts".* FROM "concerts" WHERE "concerts"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]