app/controllers/concert_preferences_controller.rb

  def index
    @concert_preferences = ConcertPreference.all
---
SELECT "concert_preferences".* FROM "concert_preferences"

  def create
    @concert_preference = ConcertPreference.new(concert_preference_params)

    respond_to do |format|
      if @concert_preference.save
---
INSERT INTO "concert_preferences" ("concert_id", "style_id", "order", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["concert_id", 1], ["style_id", 1], ["order", 1], ["created_at", 2016-11-03 09:36:02 UTC], ["updated_at", 2016-11-03 09:36:02 UTC]]

  def search
	@concert_preferences=ConcertPreference.where(style_id: params[:style_id])
---
SELECT "concert_preferences".* FROM "concert_preferences" WHERE "concert_preferences"."style_id" = ?  [["style_id", 2]]

    def set_concert_preference
      @concert_preference = ConcertPreference.find(params[:id])
---
SELECT  "concert_preferences".* FROM "concert_preferences" WHERE "concert_preferences"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]