app/controllers/music_styles_controller.rb

SELECT "music_styles".* FROM "music_styles"
---
  def index
    @music_styles = MusicStyle.all

INSERT INTO "music_styles" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    @music_style = MusicStyle.new(music_style_params)

    respond_to do |format|
      if @music_style.save

SELECT  "music_styles".* FROM "music_styles" WHERE "music_styles"."name" = ? ORDER BY "music_styles"."id" ASC LIMIT ?  [["name", "Jazz"], ["LIMIT", 1]]
---
  def search
	@music_styles=MusicStyle.where(name: params[:name])

SELECT  "music_styles".* FROM "music_styles" WHERE "music_styles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_music_style
      @music_style = MusicStyle.find(params[:id])