app/controllers/reservations_controller.rb

  def create
    @reservation = Reservation.new(reservation_params)

    respond_to do |format|
      if @reservation.save
---
INSERT INTO "reservations" ("user_id", "concert_id", "nb_people", "total_price", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 1], ["concert_id", 1], ["nb_people", 3], ["total_price", 45], ["created_at", 2016-10-15 13:43:03 UTC], ["updated_at", 2016-10-15 13:43:03 UTC]]