app/controllers/users_controller.rb

INSERT INTO "users" ("user_name", "email", "password", "first_name", "last_name", "location", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

SELECT "users".* FROM "users" WHERE "users"."user_name" = ?  [["user_name", "taha"]]
SELECT  "users".* FROM "users" WHERE "users"."password" = ? ORDER BY "users"."id" ASC LIMIT ?  [["password", "bonjour"], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."user_name" = ? AND "users"."password" IS NULL  [["user_name", "taha"]]
SELECT "user_preferences".* FROM "user_preferences" WHERE "user_preferences"."user_id" = ?  [["user_id", 2]]
SELECT  "music_styles".* FROM "music_styles" WHERE "music_styles"."id" = ? ORDER BY "music_styles"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def search
	if params[:user_name]
	    then
	    user=User.where(user_name: params[:user_name])
	else
	    user = nil
	end

	music_styles = []
    if user.nil?
    then
        @user = nil
    else
        if  params[:password].nil?
        then
            @user = nil
        else
            user=User.where(password: params[:password])
            if user.first != nil
            then
                @user=user.first
                user_preferences=UserPreference.where(user_id: user.first.id)
                styles_ids = []
                user_preferences.each do |pref|
                    styles_ids << pref.style_id
                end
                music_styles = []
                styles_ids.each do |id|
                    music_styles << MusicStyle.where(id: id)