app/controllers/user_preferences_controller.rb

  def index
    @user_preferences = UserPreference.all
---
SELECT "user_preferences".* FROM "user_preferences"

  def create
    @user_preference = UserPreference.new(user_preference_params)

    respond_to do |format|
      if @user_preference.save
---
INSERT INTO "user_preferences" ("user_id", "style_id", "order", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["style_id", 1], ["order", 1], ["created_at", 2016-10-15 13:41:03 UTC], ["updated_at", 2016-10-15 13:41:03 UTC]]

    def set_user_preference
      @user_preference = UserPreference.find(params[:id])
---
SELECT  "user_preferences".* FROM "user_preferences" WHERE "user_preferences"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]